DOC: Diagram updated
